In [30]:
import pandas as pd

In [31]:
data = [
    {'Nombre': 'Ana', 'Edad': 25, 'Ciudad': 'Madrid'},
    {'Nombre': 'Luis', 'Edad': 30, 'Ciudad': 'Barcelona'},
    {'Nombre': 'Pedro', 'Edad': 22, 'Ciudad': 'Valencia'}
]
df = pd.DataFrame(data)
df

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Luis    30  Barcelona
2  Pedro    22   Valencia

In [48]:
data = {
    'Nombre': ['Ana', 'Luis', 'Pedro', 'Ana'],
    'Edad': [25, 30, None, 29],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', None]
}
df = pd.DataFrame(data)
df

  Nombre  Edad     Ciudad
0    Ana  25.0     Madrid
1   Luis  30.0  Barcelona
2  Pedro   NaN   Valencia
3    Ana  29.0       None

In [33]:
nombres = df['Nombre']
nombres

0      Ana
1     Luis
2    Pedro
3    Marta
Name: Nombre, dtype: object

In [34]:
df['Salario'] = [30000, 40000, 25000, 32000]
df

  Nombre  Edad     Ciudad  Salario
0    Ana    25     Madrid    30000
1   Luis    30  Barcelona    40000
2  Pedro    22   Valencia    25000
3  Marta    29    Sevilla    32000

In [35]:
df.drop('Salario', axis=1, inplace=True)
df

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Luis    30  Barcelona
2  Pedro    22   Valencia
3  Marta    29    Sevilla

In [37]:
primera_fila = df.iloc[2] 
primera_fila

Nombre       Pedro
Edad            22
Ciudad    Valencia
Name: 2, dtype: object

In [39]:
df

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Luis    30  Barcelona
2  Pedro    22   Valencia
3    Ana    29    Sevilla

In [40]:
 df.loc[df['Nombre'] == 'Ana']

  Nombre  Edad   Ciudad
0    Ana    25   Madrid
3    Ana    29  Sevilla

In [43]:
df[df['Edad'] >= 30]

  Nombre  Edad     Ciudad
1   Luis    30  Barcelona

In [45]:
df.sort_values(by='Edad', ascending=False)

  Nombre  Edad     Ciudad
1   Luis    30  Barcelona
3    Ana    29    Sevilla
0    Ana    25     Madrid
2  Pedro    22   Valencia

In [46]:
df['Edad'].mean()

26.5

In [47]:
df['Edad'].max()

30

In [49]:
df

  Nombre  Edad     Ciudad
0    Ana  25.0     Madrid
1   Luis  30.0  Barcelona
2  Pedro   NaN   Valencia
3    Ana  29.0       None

In [52]:
df_limpio = df.dropna()

In [53]:
df

  Nombre  Edad     Ciudad
0    Ana  25.0     Madrid
1   Luis  30.0  Barcelona
2  Pedro   NaN   Valencia
3    Ana  29.0       None

In [56]:
df.fillna(value={'Edad': 20,'Ciudad':'Lima'})

  Nombre  Edad     Ciudad
0    Ana  25.0     Madrid
1   Luis  30.0  Barcelona
2  Pedro  20.0   Valencia
3    Ana  29.0       Lima

In [55]:
df

  Nombre  Edad     Ciudad
0    Ana  25.0     Madrid
1   Luis  30.0  Barcelona
2  Pedro   NaN   Valencia
3    Ana  29.0       None